app/Controllers/DocenteController.php

SELECT *
FROM `docente`
---
    public function index(): string
    {
        $docenteModel = model('DocenteM');

        $data['docente'] = $docenteModel->findAll();