app/Controllers/Front.php

    public function frontManuales()
    {
        $manualesModel = model('ManualesM');
        $data['manuales'] = $manualesModel->findAll();
---
SELECT *
FROM `manuales`