app/Controllers/MateriasController.php

        public function index():string
        {

        $materiasModel = model('MateriasM');
        $data['materias'] = $materiasModel->findAll();
---
SELECT *
FROM `materias`

        }
        else{
            $materiasModel = model('MateriasM');
            $materiasModel->insert($data);
---
INSERT INTO `materias` (`nombre`, `planEstudios`) VALUES ('Programacion Orientada a Objetos', '2010')

    public function delete($idMateria){


        $materiasModel = model('MateriasM');
        $materiasModel->delete($idMateria);
---
DELETE FROM `materias`
WHERE `idMateria` IN ('2')