app/Controllers/SoftwareController.php

SELECT *
FROM `software`
---
    public function index(): string
    {
        // Verificación de sesión
        $this->checkSession();

        $softwareModel = model('SoftwareM');
        $data['software'] = $softwareModel->findAll();